<a href="https://colab.research.google.com/github/Praveen-Progs-Hub-2018/Tensorflow/blob/master/lamda_funcs.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:

import pandas as pd
import numpy as np
import datetime
numdays=5
base=datetime.date.today()
date_list=[base - datetime.timedelta(days=x) for x in range(numdays)]
random_a=np.random.randint(0, 100, size=numdays)
random_b=np.random.randint(0, 100, size=numdays)
df=pd.DataFrame({'date': date_list, 'a': random_a, 'b': random_b})

#Refference link
#https://python.plainenglish.io/feature-engineering-with-map-apply-and-lambda-functions-in-pandas-454ec2048eed
#---Funcs applicable
# df['dow']     = df['date'].map(lambda x: x.weekday())
# df['weekday'] = df['date'].map(lambda x: 'Y' if x.weekday()<5 else 'N')

# df['total']=df[['a', 'b']].apply(lambda x: x['a']+x['b'], axis=1)
# df.loc['sum']=df[['a', 'b']].apply(lambda x: x.sum(), axis=0)
# df[['a', 'b']].rolling(window=2).apply(lambda x: np.mean([x.iloc[0], x.iloc[1]]))
# df.groupby('weekday').apply(lambda x: x['total']/x['total'].sum())

         date   a   b
0  2021-11-24  24  16
1  2021-11-23  75  11
2  2021-11-22  15  47
3  2021-11-21  18  69
4  2021-11-20  34  49

In [8]:
df['dow']     = df['date'].map(lambda x: x.weekday())
df['weekday'] = df['date'].map(lambda x: 'Y' if x.weekday()<5 else 'N')
df

         date   a   b  dow weekday
0  2021-11-24  24  16    2       Y
1  2021-11-23  75  11    1       Y
2  2021-11-22  15  47    0       Y
3  2021-11-21  18  69    6       N
4  2021-11-20  34  49    5       N

In [9]:
df['total']=df[['a', 'b']].apply(lambda x: x['a']+x['b'], axis=1)
df.loc['sum']=df[['a', 'b']].apply(lambda x: x.sum(), axis=0)
df

           date      a      b  dow weekday  total
0    2021-11-24   24.0   16.0  2.0       Y   40.0
1    2021-11-23   75.0   11.0  1.0       Y   86.0
2    2021-11-22   15.0   47.0  0.0       Y   62.0
3    2021-11-21   18.0   69.0  6.0       N   87.0
4    2021-11-20   34.0   49.0  5.0       N   83.0
sum         NaN  166.0  192.0  NaN     NaN    NaN

In [11]:
df[['a', 'b']].rolling(window=2).apply(lambda x: np.mean([x.iloc[0], x.iloc[1]]))
df

         a      b
0      NaN    NaN
1     49.5   13.5
2     45.0   29.0
3     16.5   58.0
4     26.0   59.0
sum  100.0  120.5

In [12]:
df.groupby('weekday').apply(lambda x: x['total']/x['total'].sum())

weekday
N        3    0.511765
         4    0.488235
Y        0    0.212766
         1    0.457447
         2    0.329787
Name: total, dtype: float64